==========
Combine instruction -- One arg
==========
replace tex0
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(tevsrc (texture)))))

==========
Combine instruction -- Two args
==========
add tex0, (1, 1, 1, 1)
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(tevsrc 
				(texture))
			(tevsrc 
				(color 
					(number
						(int)) 
					(number
						(int)) 
					(number
						(int)) 
					(number 
						(int)))))))

==========
Combine instruction -- Three args
==========
interpolate tex0, #DEADBEEF, tex3
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(tevsrc (texture))
			(tevsrc (color (hexcode)))
			(tevsrc (texture)))))

==========
Combine instruction -- Mode selector
==========
interpolate rgb tex0, #ffffffff, tex3
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(texenvmode)
			(tevsrc (texture))
			(tevsrc (color (hexcode)))
			(tevsrc (texture)))))

==========
Combine instruction -- tevop
==========
interpolate rgb tex0.r, (1.0, 0, 1, 0.0).inva, tex3.rgb
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(texenvmode)
			(tevsrc (texture) (tevop))
			(tevsrc (color
				(number
					(float))
				(number
					(int))
				(number
					(int))
				(number
					(float))) (tevop))
			(tevsrc (texture) (tevop)))))

==========
Hex colour
==========
replace #FFFFFFFF
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(tevsrc
				(color
					(hexcode))))))

==========
Per-component colour
==========
replace (0.0, 1, 0, 1.0)
---
(program
	(instr
		(combineinstr
			(combinefunc)
			(tevsrc
				(color
					(number
						(float))
					(number
						(int))
					(number
						(int))
					(number
						(float)))))))

==========
Alpha test
==========
alphatest 0.5
---
(program
	(instr
		(selectorinstr
			(alphatest
				(number
					(float))))))

==========
Normal map
==========
normal tex3, bump
---
(program
	(instr
		(selectorinstr
			(normal
				(texture)
				(normalselector)))))

==========
Buffer write mask
==========
write color
---
(program
	(instr
		(selectorinstr
			(write
				(writemask)))))

==========
Depth test
==========
depthtest greater
---
(program
	(instr
		(selectorinstr
			(depthtest
				(testfunc)))))